<a href="https://colab.research.google.com/github/dsreliete/Womakerscode_DA_colab_desafio_individual/blob/main/Desafio2IndividualElietedaSilvaRodrigues.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [91]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [92]:
%%sql
sqlite:///desafio.db

In [93]:
import sqlite3

In [94]:
conexao = sqlite3.connect('desafio.db')
cursor = conexao.cursor()

In [95]:
# 1. Crie uma tabela chamada "alunos" com os seguintes campos: id (inteiro), nome (texto), idade (inteiro) e curso (texto).

cursor.execute('CREATE TABLE alunos(id INT, nome VARCHAR(100), idade INT, curso VARCHAR(200));')

OperationalError: table alunos already exists

In [97]:
# 2. Insira pelo menos 5 registros de alunos na tabela que você criou no exercício anterior.

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(1, "Eliete", 39, "Data Analytics")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(2, "Sheldon", 10, "Adestramento")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(3, "Felipe", 24, "Engenharia")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(4, "Mariana", 14, "Jazz")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(5, "Helena", 69, "Poesia")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(6, "Evandro", 38, "Engenharia")')

cursor.execute('INSERT INTO alunos(id, nome, idade, curso) VALUES(7, "Jurandir", 45, "Engenharia")')

In [98]:
# 3. Consultas Básicas
# Escreva consultas SQL para realizar as seguintes tarefas:
# a) Selecionar todos os registros da tabela "alunos".

cursor.execute('SELECT * FROM alunos;')
print(cursor.fetchall())

[(1, 'Eliete', 20, 'Data Analytics'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia'), (1, 'Eliete', 39, 'Data Analytics'), (2, 'Sheldon', 10, 'Adestramento'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia')]

In [99]:
# b) Selecionar o nome e a idade dos alunos com mais de 20 anos.

cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20;')
print(cursor.fetchall())

[('Felipe', 24), ('Helena', 69), ('Evandro', 38), ('Jurandir', 45), ('Eliete', 39), ('Felipe', 24), ('Helena', 69), ('Evandro', 38), ('Jurandir', 45)]

In [100]:
# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética.

cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome;')
print(cursor.fetchall())

[(6, 'Evandro', 38, 'Engenharia'), (6, 'Evandro', 38, 'Engenharia'), (3, 'Felipe', 24, 'Engenharia'), (3, 'Felipe', 24, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia')]

In [101]:
# d) Contar o número total de alunos na tabela

cursor.execute('SELECT COUNT(*) FROM alunos;')
print(cursor.fetchall())

[(13,)]

In [102]:
# 4. Atualização e Remoção
# a) Atualize a idade de um aluno específico na tabela.

cursor.execute('UPDATE alunos SET idade = 20 WHERE id = 1;')
cursor.execute('SELECT * FROM alunos;')
print(cursor.fetchall())

[(1, 'Eliete', 20, 'Data Analytics'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia'), (1, 'Eliete', 20, 'Data Analytics'), (2, 'Sheldon', 10, 'Adestramento'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia')]

In [103]:
# b) Remova um aluno pelo seu ID.

cursor.execute('DELETE FROM alunos WHERE id = 2;')
cursor.execute('SELECT * FROM alunos;')
print(cursor.fetchall())

[(1, 'Eliete', 20, 'Data Analytics'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia'), (1, 'Eliete', 20, 'Data Analytics'), (3, 'Felipe', 24, 'Engenharia'), (4, 'Mariana', 14, 'Jazz'), (5, 'Helena', 69, 'Poesia'), (6, 'Evandro', 38, 'Engenharia'), (7, 'Jurandir', 45, 'Engenharia')]

In [104]:
# 5. Criar uma Tabela e Inserir Dados
# Crie uma tabela chamada "clientes" com os campos: id (chave primária), nome (texto), idade (inteiro) e saldo (float).

cursor.execute('CREATE TABLE clientes(id INT, nome VARCHAR(100), idade INT, saldo REAL);')

OperationalError: table clientes already exists

In [105]:
# Insira alguns registros de clientes na tabela.

cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(1, "Eliete", 39, 1100.00)')

cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(2, "Sheldon", 10, 0.00)')

cursor.execute('INSERT INTO clientes(id, nome, idade, saldo) VALUES(3, "Felipe", 24, 120.00)')

In [106]:
# 6. Consultas e Funções Agregadas
# Escreva consultas SQL para realizar as seguintes tarefas:
# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos.
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30;')
print(cursor.fetchall())

[('Eliete', 39), ('Eliete', 39)]

In [107]:
# b) Calcule o saldo médio dos clientes.
cursor.execute('SELECT AVG(saldo) FROM clientes;')
print(cursor.fetchall())

[(568.0,)]

In [108]:
# c) Encontre o cliente com o saldo máximo.
cursor.execute('SELECT * FROM clientes WHERE saldo = (SELECT MAX(saldo) FROM clientes);')
print(cursor.fetchall())

[(1, 'Eliete', 39, 1500.0)]

In [109]:
# d) Conte quantos clientes têm saldo acima de 1000.
cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000;')
print(cursor.fetchall())

[(2,)]

In [110]:
# 7. Atualização e Remoção com Condições
# a) Atualize o saldo de um cliente específico.

cursor.execute('UPDATE clientes SET saldo = 1500.00 WHERE id = 1;')
cursor.execute('SELECT * FROM clientes;')
print(cursor.fetchall())

[(1, 'Eliete', 39, 1500.0), (3, 'Felipe', 24, 120.0), (1, 'Eliete', 39, 1500.0), (2, 'Sheldon', 10, 0.0), (3, 'Felipe', 24, 120.0)]

In [111]:
# b) Remova um cliente pelo seu ID.

cursor.execute('DELETE FROM clientes WHERE id = 2;')
cursor.execute('SELECT * FROM clientes;')
print(cursor.fetchall())

[(1, 'Eliete', 39, 1500.0), (3, 'Felipe', 24, 120.0), (1, 'Eliete', 39, 1500.0), (3, 'Felipe', 24, 120.0)]

In [112]:
# 8. Junção de Tabelas
# Crie uma segunda tabela chamada "compras" com os campos: id (chave primária), cliente_id (chave estrangeira referenciando o id da tabela "clientes"), produto (texto) e valor (real).

cursor.execute('CREATE TABLE compras(id INT, cliente_id INT, produto VARCHAR(100), valor REAL);')

OperationalError: table compras already exists

In [113]:
# Insira algumas compras associadas a clientes existentes na tabela "clientes".

cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(1, 1, "Camiseta", 500.00)')

cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(2, 1, "Calça", 800.00)')

cursor.execute('INSERT INTO compras(id, cliente_id, produto, valor) VALUES(3, 2, "Tênis", 1200.00)')

In [114]:
cursor.execute('SELECT * FROM compras;')
print(cursor.fetchall())

[(1, 1, 'Camiseta', 500.0), (2, 1, 'Calça', 800.0), (3, 2, 'Tênis', 1200.0), (1, 1, 'Camiseta', 500.0), (2, 1, 'Calça', 800.0), (3, 2, 'Tênis', 1200.0)]

In [115]:
# Escreva uma consulta para exibir o nome do cliente, o produto e o valor de cada compra.

cursor.execute('SELECT clientes.nome, compras.produto, compras.valor FROM clientes INNER JOIN compras ON clientes.id = compras.cliente_id;')
print(cursor.fetchall())

[('Eliete', 'Calça', 800.0), ('Eliete', 'Calça', 800.0), ('Eliete', 'Camiseta', 500.0), ('Eliete', 'Camiseta', 500.0), ('Eliete', 'Calça', 800.0), ('Eliete', 'Calça', 800.0), ('Eliete', 'Camiseta', 500.0), ('Eliete', 'Camiseta', 500.0)]

In [88]:
conexao.commit()
conexao.close()